kateya-luo/luoye/firmware/sdkconfig.defaults
# ESP32-S3-WROOM-1U-N16R8:16MB QIO Flash + 8MB 八线 PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# 普通堆、Wi-Fi 与 lwIP 优先走 PSRAM；内部 RAM 留给 DMA/任务栈。
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# Wi-Fi DMA 发送缓冲在启动时固定分配，上传期间不再突发抢占内部堆。
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=32

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_FREERTOS_HZ=1000

# Bulk-upload TCP profile: keep enough data in flight on public WAN paths.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=24
CONFIG_LWIP_TCP_SACK_OUT=y

# FATFS 长文件名 + UTF-8。SD 逻辑扇区固定 512B，缓存优先走 PSRAM。
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_SECTOR_512=y
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y
